# SpacePowerScheduleParam Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..SpacePowerScheduleParam Property
ParameterTypeId Class See Also
---
"Power Schedule"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId SpacePowerScheduleParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SpacePowerScheduleParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ SpacePowerScheduleParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace